app/Controllers/Barang.php

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '19'
---
    public function delete($id_barang)
    {
        $barang = $this->barangModel->find($id_barang);

SELECT *
FROM `kecamatan`
SELECT *
FROM `desa`
---
        // Ambil data kecamatan dan desa dari model jika diperlukan
        $data = [
            'title' => 'Ubah Profil | WarungPedia',
            'kecamatan' => $this->kecamatan->findAll(),
            'desa' => $this->desaModel->findAll(),